#pragma once
#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include "dmassive.h"
#define MOD_ONE 1
#define MOD_SEVERAL 2

#define HEADER_MAIN \
    "╭─────────────────────────────╮\n" \
    "│      ГЛАВНОЕ МЕНЮ           │\n" \
    "╰─────────────────────────────╯"

#define MAIN_MENU_BASE_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Создать массив           │\n" \
    "│ 2. Вставить элемент         │\n" \
    "│ 3. Удалить элемент          │\n" \
    "│ 4. Поиск                    │\n" \
    "│ 5. Перемешать               │\n" \
    "│ 6. Сортировать              │\n" \
    "│ 7. Очистить массив          │\n" \
    "│ 8. Сохранить в файл         │\n" \
    "│ 9. Загрузить из файла       │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"

#define MAIN_MENU_ITEMS_COUNT 9
#define USER_CHOOSE_TEXT "\n\
┌─────────────────────────────┐\n\
│ Выберите пункт:             │\n\
└─────────────────────────────┘\n> "
#define HEADER_MODE \
    "╭─────────────────────────────╮\n" \
    "│      РЕЖИМ РАБОТЫ           │\n" \
    "╰─────────────────────────────╯"

#define MODE_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Один элемент             │\n" \
    "│ 2. Несколько элементов      │\n" \
    "│ 3. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define MODE_MENU_ITEMS_COUNT 3

#define HEADER_CREATE \
    "╭─────────────────────────────╮\n" \
    "│      СОЗДАНИЕ МАССИВА       │\n" \
    "╰─────────────────────────────╯"

#define CREATE_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Пустой                   │\n" \
    "│ 2. Случайные значения       │\n" \
    "│ 3. Ручной ввод              │\n" \
    "│ 4. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"

#define CREATE_MENU_ITEMS_COUNT 4

#define HEADER_INSERT \
    "╭─────────────────────────────╮\n" \
    "│        ВСТАВКА              │\n" \
    "╰─────────────────────────────╯"

#define INSERT_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. В начало                 │\n" \
    "│ 2. В конец                  │\n" \
    "│ 3. По позиции               │\n" \
    "│ 4. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define INSERT_MENU_ITEMS_COUNT 4
#define HEADER_ERASE \
    "╭─────────────────────────────╮\n" \
    "│         УДАЛЕНИЕ            │\n" \
    "╰─────────────────────────────╯"

#define ERASE_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Из начала                │\n" \
    "│ 2. Из конца                 │\n" \
    "│ 3. По позиции               │\n" \
    "│ 4. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define ERASE_MENU_ITEMS_COUNT 4

#define HEADER_SEARCH \
    "╭─────────────────────────────╮\n" \
    "│           ПОИСК             │\n" \
    "╰─────────────────────────────╯"

#define SEARCH_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Количество               │\n" \
    "│ 2. Первое вхождение         │\n" \
    "│ 3. Последнее вхождение      │\n" \
    "│ 4. Все вхождения            │\n" \
    "│ 5. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define SEARCH_MENU_ITEMS_COUNT 5

#define HEADER_SORT_MOD \
    "╭─────────────────────────────╮\n" \
    "│  РЕЖИМ СОРТИРОВКИ           │\n" \
    "╰─────────────────────────────╯"

#define SORT_MODE_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. По возрастанию           │\n" \
    "│ 2. По убыванию              │\n" \
    "│ 3. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define SORT_MODE_MENU_ITEMS_COUNT 3

#define HEADER_SORT \
    "╭─────────────────────────────╮\n" \
    "│      СОРТИРОВКА             │\n" \
    "╰─────────────────────────────╯"

#define SORT_MENU_TEXT \
    "╭─────────────────────────────╮\n" \
    "│ 1. Пузырьковая              │\n" \
    "│ 2. Модиф. пузырьковая       │\n" \
    "│ 3. Быстрая                  │\n" \
    "│ 4. Шейкерная                │\n" \
    "│ 5. Назад                    │\n" \
    "│ 0. Выход                    │\n" \
    "╰─────────────────────────────╯"
#define SORT_MENU_ITEMS_COUNT 5
#define FILE_PROPERTIES_MENU 3
#define PATH_MENU_TEXT "\n" \
                       "╭────────────────────────────────────────────╮\n" \
                       "│         ВЫБЕРИТЕ ПУТЬ ДЛЯ МАССИВА          │\n" \
                       "├────────────────────────────────────────────┤\n" \
                       "│                                            │\n" \
                       "│     1.   Текущая директория                │\n" \
                       "│                                            │\n" \
                       "│     2.   Ввести свою директорию            │\n" \
                       "│                                            │\n" \
                       "│     0.    Назад                            │\n" \
                       "│                                            │\n" \
                       "╰────────────────────────────────────────────╘\n\n" \
                       "Ваш выбор: "
#define CHOOSE_FILE_NAME_TEXT "\n\
┌───────────────────────────────────────────────┐\n\
│ Введите имя файла или пробел для выхода       │\n\
└───────────────────────────────────────────────┘\n>"
#define DIR_FILE_NAME_TEXT "\n\
┌───────────────────────────────────────────────────────────────┐\n\
│ Введите путь для сохранения файла или пробел для выхода       │\n\
└───────────────────────────────────────────────────────────────┘\n>"
void main_menu();
int mod_menu(bool* exit_flag);
void erase_menu(bool* exit_flag, DMassive* mass, int mod);
void sort_mode_menu(bool* exit_flag, DMassive* mass);
void sort_menu(bool* exit_flag, DMassive* mass);
void create_arr_menu(bool* exit_flag, DMassive* mass);
void insert_menu(bool* exit_flag, DMassive* mass, int mod);
void search_menu(bool* exit_flag, DMassive* mass);
int choose_file_properties_menu(bool* exit_flag,char*dir,char*file_name,char type);